# PyBank

In [ ]:
#import pandas
import pandas as pd

In [30]:
#Load the sales data
salesdf = pd.read_csv('budget_data.csv')
salesdf.head()

     Date  Profit/Losses
0  Jan-10         867884
1  Feb-10         984655
2  Mar-10         322013
3  Apr-10         -69417
4  May-10         310503

In [31]:
#check data type
salesdf.dtypes

Date             object
Profit/Losses     int64
dtype: object

In [32]:
salesdf

      Date  Profit/Losses
0   Jan-10         867884
1   Feb-10         984655
2   Mar-10         322013
3   Apr-10         -69417
4   May-10         310503
..     ...            ...
81  Oct-16         102685
82  Nov-16         795914
83  Dec-16          60988
84  Jan-17         138230
85  Feb-17         671099

[86 rows x 2 columns]

In [33]:
#summary stats
salesdf.describe()

       Profit/Losses
count   8.600000e+01
mean    4.463090e+05
std     5.363579e+05
min    -1.196225e+06
25%     1.821620e+05
50%     5.703280e+05
75%     7.952262e+05
max     1.170593e+06

In [34]:
#finding how many months we have
salesdf.shape[0]

86

In [22]:
#aggregate sales
salesdf = salesdf.groupby(by=['Date']).sum()

In [35]:
salesdf

      Date  Profit/Losses
0   Jan-10         867884
1   Feb-10         984655
2   Mar-10         322013
3   Apr-10         -69417
4   May-10         310503
..     ...            ...
81  Oct-16         102685
82  Nov-16         795914
83  Dec-16          60988
84  Jan-17         138230
85  Feb-17         671099

[86 rows x 2 columns]

In [36]:
#getting the sum
salesdf.sum()

Date             Jan-10Feb-10Mar-10Apr-10May-10Jun-10Jul-10Aug-...
Profit/Losses                                             38382578
dtype: object

In [37]:
#getting average
salesdf.mean()

Profit/Losses    446309.046512
dtype: float64

In [38]:
#creating net change  
salesdf['shift1'] = salesdf['Profit/Losses'].shift(1)
salesdf.head()

     Date  Profit/Losses    shift1
0  Jan-10         867884       NaN
1  Feb-10         984655  867884.0
2  Mar-10         322013  984655.0
3  Apr-10         -69417  322013.0
4  May-10         310503  -69417.0

In [39]:
#calulate net change
salesdf['netchange'] = salesdf['Profit/Losses'] - salesdf['shift1']
salesdf.head()

     Date  Profit/Losses    shift1  netchange
0  Jan-10         867884       NaN        NaN
1  Feb-10         984655  867884.0   116771.0
2  Mar-10         322013  984655.0  -662642.0
3  Apr-10         -69417  322013.0  -391430.0
4  May-10         310503  -69417.0   379920.0

In [40]:
# average of net change
salesdf['netchange'].mean()

-2315.1176470588234

In [41]:
#get the max of net change
salesdf['netchange'].max()

1926159.0

In [42]:
#getting the date/index of the greatest increase
salesdf.netchange[salesdf.netchange == salesdf['netchange'].max()].index.tolist()

[25]

In [43]:
salesdf.tail()

      Date  Profit/Losses    shift1  netchange
81  Oct-16         102685  768450.0  -665765.0
82  Nov-16         795914  102685.0   693229.0
83  Dec-16          60988  795914.0  -734926.0
84  Jan-17         138230   60988.0    77242.0
85  Feb-17         671099  138230.0   532869.0

In [44]:
#get the greatest decrease
salesdf['netchange'].min()

-2196167.0

In [58]:
#getting the date/index of the greatest decrease
salesdf.netchange[salesdf.netchange == salesdf['netchange'].min()].index.tolist()

[44]

In [59]:
# Create Sales Summary into a text file
with open('Sales_Analysis_Summary.txt',"w") as file: 
    file.write("Financial Analysis")
    file.write("\n")
    file.write("***************")
    file.write("\n")
    file.write(f"Total Months: {salesdf.shape[0]}")
    file.write("\n")
    file.write(f"Total Sales: ${salesdf.sum()}")
    file.write("\n")
    file.write(f"Average Net Change: ${round(salesdf['netchange'].mean(),2)}")
    file.write("\n")
    file.write(f"Greatest Increase in Profits: {salesdf.netchange[salesdf.netchange == salesdf['netchange'].max()].index.tolist()} {round(salesdf['netchange'].max(),2)}")
    file.write("\n") 
    file.write(f"Greatest Decrease in Profits: {salesdf.netchange[salesdf.netchange == salesdf['netchange'].min()].index.tolist()} {round(salesdf['netchange'].min(),2)}")